Revit 2027 API
Ceramic.CeramicBump Property
 The property labeled "Type" from the "Ceramic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string CeramicBump { get; }
Public Shared ReadOnly Property CeramicBump As String
	Get
public:
static property String^ CeramicBump {
	String^ get ();
}
static member CeramicBump : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "CeramicBumpType".
See Also
Reference
Ceramic Class
Autodesk.Revit.DB.Visual Namespace